//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : 
//
//=============================================================================
#ifndef _BGAGE_H_
#define _BGAGE_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_BGAGE		_T("data/TEXTURE/rifle.png")			// 読み込むテクスチャファイル名
#define	BGAGE_POS_X			(40)								// タイトルの表示位置
#define	BGAGE_POS_Y			(400)								// タイトルの表示位置
#define	BGAGE_SIZE_X		(100)								// タイトルの幅
#define	BGAGE_SIZE_Y		(50)								// タイトルの高さ
#define BGAGE_MAX			(1)

typedef struct	// エネミー構造体
{
	bool			use;						// true:使用  false:未使用

} BGAGE;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBgage(void);
void UninitBgage(void);
void UpdateBgage(void);
void DrawBgage(void);
//LOGO*GetBgage(int no);

#endif
