//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : 
//
//=============================================================================
#ifndef _TGAGE_H_
#define _TGAGE_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_TGAGE		_T("data/TEXTURE/runa.png")			// 読み込むテクスチャファイル名
#define	TGAGE_POS_X			(550)								// タイトルの表示位置
#define	TGAGE_POS_Y			(-60)								// タイトルの表示位置
#define	TGAGE_SIZE_X		(200)							// タイトルの幅
#define	TGAGE_SIZE_Y		(200)							// タイトルの高さ
#define TGAGE_MAX			(1)

typedef struct	// エネミー構造体
{
	bool			use;						// true:使用  false:未使用

} TGAGE;
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTgage(void);
void UninitTgage(void);
void UpdateTgage(void);
void DrawTgage(void);
TGAGE *GetTgage(int no);
#endif